PIT3/examples/ERR Scenarios/XML Scenarios/Multiple Employees Single Expenses/LookupERN_Multiple_Employees_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ern="http://www.ros.ie/schemas/paye-employers/err/v1/ern/">
   <soap:Header/>
   <soap:Body>
      <ern:LookUpERNRequest>
         <ern:EmployerRegistrationNumber>7654321T</ern:EmployerRegistrationNumber>
         <ern:SoftwareUsed>
            <ern:Name>SOAP UI</ern:Name>
            <ern:Version>5.4.0</ern:Version>
         </ern:SoftwareUsed>
         <ern:TaxYear>2023</ern:TaxYear>
         <!--Zero or more repetitions:-->
         <ern:PPSN>1234567X</ern:PPSN>
         <ern:PPSN>7654321X</ern:PPSN>
         <ern:PPSN>7654322X</ern:PPSN>
      </ern:LookUpERNRequest>
   </soap:Body>
</soap:Envelope>